{
  "schema_version": "1.4.0",
  "id": "GHSA-vggm-3478-vm5m",
  "modified": "2024-11-18T20:02:26Z",
  "published": "2024-11-18T20:02:26Z",
  "aliases": [
    "CVE-2024-52506"
  ],
  "summary": "Graylog concurrent PDF report rendering can leak other users' reports",
  "details": "### Impact\n\nThe reporting functionality in Graylog allows the creation and scheduling of reports which contain dashboard widgets displaying individual log messages or metrics aggregated from fields of multiple log messages. This functionality, as included in Graylog 6.1.0 & 6.1.1, is vulnerable to information leakage triggered by multiple concurrent report rendering requests from authorized users.\n\nWhen multiple report renderings are requested at the same start time, the headless browser instance used to render the PDF will be reused. Depending on the timing, either a check for the browser instance \"freshness\" hits, resulting in an error instead of the report being returned, or one of the concurrent report rendering requests \"wins\" and this report is returned for all report rendering requests that do not return an error. This might lead to one user getting the report of a different user, potentially leaking indexed log messages or aggregated data that this user normally has no access to.\n\n### Patches\nThis problem is fixed in Graylog 6.1.2.\n\n### Workarounds\nThere is no known workaround besides disabling the reporting functionality.\n\n### References\n\n",
  "severity": [

  ],
  "affected": [
    {
      "package": {
        "ecosystem": "Maven",
        "name": "org.graylog:graylog-parent"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "6.1.0"
            },
            {
              "fixed": "6.1.2"
            }
          ]
        }
      ]
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/Graylog2/graylog2-server/security/advisories/GHSA-vggm-3478-vm5m"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/Graylog2/graylog2-server"
    }
  ],
  "database_specific": {
    "cwe_ids": [
      "CWE-200"
    ],
    "severity": "HIGH",
    "github_reviewed": true,
    "github_reviewed_at": "2024-11-18T20:02:26Z",
    "nvd_published_at": null
  }
}